Infineon/mtb-example-psoc4-msclp-capsense-low-power/main.c
/******************************************************************************
* File Name:   main.c
*
* Description: This is the source code for the PSoC 4: MSCLP CAPSENSE&trade; Low Power
*              Example for ModusToolbox.
*
* Related Document: See README.md
*
*
*******************************************************************************
* $ Copyright 2021-2022 Cypress Semiconductor $
*******************************************************************************/

/*******************************************************************************
 * Include header files
 ******************************************************************************/

#include "cy_pdl.h"
#include "cybsp.h"
#include "cycfg.h"
#include "cycfg_capsense.h"
#include "SpiMaster.h"
#include "LEDcontrol.h"

/*******************************************************************************
* User configurable Macros
********************************************************************************/

/* Enable this, if Serial LED needs to be enabled */
#define ENABLE_SPI_SERIAL_LED            (1u)

/* Enable this, if Tuner needs to be enabled */
#define ENABLE_TUNER                     (1u)

/* Enable this, if Debugging needs to be enabled -
 *    See Readme for more details.
 *    SWD and Tuner cannot be enabled together as the pins are MUXed in CY8CKIT-040T */
#define SWD_DEBUG_ENABLE                 (0u)

/* 128Hz Refresh rate in Active mode */
#define ACTIVE_MODE_REFRESH_RATE         (128u)

/* 32Hz Refresh rate in Active-Low Refresh rate(ALR) mode */
#define ALR_MODE_REFRESH_RATE            (32u)

/* Timeout to move from ACTIVE mode to ALR mode if there is no user activity */
#define ACTIVE_MODE_TIMEOUT_SEC          (10u)

/* Timeout to move from ALR mode to WOT mode if there is no user activity */
#define ALR_MODE_TIMEOUT_SEC             (5u)

/* Active mode Scan time in us ~= 16us */
#define ACTIVE_MODE_FRAME_SCAN_TIME      (16u)
/* Active mode Processing time in us ~= 25us with Serial LED and Tuner disabled
 * and 179us with Serial LED and Tuner enabled */
#define ACTIVE_MODE_PROCESS_TIME         (25u)

/* ALR mode Scan time in us ~= 16us */
#define ALR_MODE_FRAME_SCAN_TIME         (16u)
/* ALR mode Processing time in us ~= 25us with Serial LED and Tuner disabled
 * and 179us with Serial LED and Tuner enabled */
#define ALR_MODE_PROCESS_TIME            (25u)

/*******************************************************************************
* Macros
********************************************************************************/
#define CAPSENSE_MSC0_INTR_PRIORITY      (3u)
#define CY_ASSERT_FAILED                 (0u)

/* Setting self-cap sensors raw-count calibration percentage to 70% */
#define CSD_CALIBRATION_LEVEL            (70u)

/* setting recommended CDAC Dither scale value. Default is '0u' */
#define    CDAC_DITHER_SCALE             (1u)

/* setting recommended CDAC Dither seed value. Default is '255u' */
#define    CDAC_DITHER_SEED              (15u)

/* setting recommended CDAC Dither poly value. Default is '142u' */
#define    CDAC_DITHER_POLY              (9u)

/* Setting SWD_DEBUG_ENABLE to 0 enabled EZI2C */
#define ENABLE_EZI2C                     (!SWD_DEBUG_ENABLE)

#if ENABLE_EZI2C
/* EZI2C interrupt priority must be higher than CAPSENSE&trade; interrupt. */
#define EZI2C_INTR_PRIORITY              (2u)
#endif

#define ILO_FREQ                         (40000u)
#define TIME_IN_US                       (1000000u)

#define MINIMUM_TIMER                    (TIME_IN_US / ILO_FREQ)
#if ((TIME_IN_US / ACTIVE_MODE_REFRESH_RATE) > (ACTIVE_MODE_FRAME_SCAN_TIME + ACTIVE_MODE_PROCESS_TIME))
    #define ACTIVE_MODE_TIMER            (TIME_IN_US / ACTIVE_MODE_REFRESH_RATE - \
                                            (ACTIVE_MODE_FRAME_SCAN_TIME + ACTIVE_MODE_PROCESS_TIME))
#elif
    #define ACTIVE_MODE_TIMER            (MINIMUM_TIMER)
#endif

#if ((TIME_IN_US / ALR_MODE_REFRESH_RATE) > (ALR_MODE_FRAME_SCAN_TIME + ALR_MODE_PROCESS_TIME))
    #define ALR_MODE_TIMER               (TIME_IN_US / ALR_MODE_REFRESH_RATE - \
                                            (ALR_MODE_FRAME_SCAN_TIME + ALR_MODE_PROCESS_TIME))
#elif
    #define ALR_MODE_TIMER               (MINIMUM_TIMER)
#endif

#define ACTIVE_MODE_TIMEOUT              (ACTIVE_MODE_REFRESH_RATE * ACTIVE_MODE_TIMEOUT_SEC)

#define ALR_MODE_TIMEOUT                 (ALR_MODE_REFRESH_RATE * ALR_MODE_TIMEOUT_SEC)

#define TIMEOUT_RESET                    (0u)

/*****************************************************************************
* Finite state machine states for device operating states
*****************************************************************************/
typedef enum
{
    ACTIVE_MODE = 0x01u,    /* Active mode - All the sensors are scanned in this state
                            * with highest refresh rate */
    ALR_MODE = 0x02u,       /* Active-Low Refresh Rate (ALR) mode - All the sensors are
                            * scanned in this state with low refresh rate */
    WOT_MODE = 0x03u        /* Wake on Touch (WoT) mode - Low Power sensors are scanned
                            * in this state with lowest refresh rate */
} APPLICATION_STATE;

/*******************************************************************************
* Function Prototypes
********************************************************************************/
static void initialize_capsense(void);
static void set_dither_parameters(void);
static void capsense_msc0_isr(void);

#if ENABLE_EZI2C
static void ezi2c_isr(void);
static void initialize_capsense_tuner(void);
#endif

#if ENABLE_SPI_SERIAL_LED
void led_control();
#endif

/* Deep Sleep Callback function */
void register_callback(void);
cy_en_syspm_status_t deep_sleep_callback(cy_stc_syspm_callback_params_t *callbackParams,
                                         cy_en_syspm_callback_mode_t mode);

/*******************************************************************************
* Global Definitions
*******************************************************************************/

